my_string = str(input('Введите произвольный текст: '))

print(len(my_string))   # Вывести длину введенной строки

print(my_string.upper())    # Выводим строку в верхнем регистре

print(my_string.lower())    # Выводим строку в нижнем регистре

print(my_string.replace(' ', '')) # Удаление всех пробелов

print(my_string[0])
print(my_string[-1])



# Измените строку my_string, удалив все пробелы.
# Выведите первый символ строки my_string.
# Выведите последний символ строки my_string.
